pipeFlowReg/case5_Steady_rad/0/zonetwo/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/zonetwo";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    zonetwo_to_zoneone
    {
        type            mappedMixed;
        field           T;              // optional field name
        value           uniform 300;
        refValue        $value;
        refGradient     uniform 0.0;
        valueFraction   uniform 1.0;
    }
    outlet
    {
        type            zeroGradient;
        // type            fixedValue;
        // value           uniform 340;
    }
    upperWall
    {
        // type            zeroGradient;
        type            fixedValue;
        value           uniform 340;
    }
    axis
    {
        type            empty;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
