pipeFlowReg/case5_Steady_rad/0/zonetwo/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/zonetwo";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    zonetwo_to_zoneone
    {
        type            zeroGradient;
        // type                fixedValue;
        // value               uniform (0 0 0);
        // type            mappedMixed;
        // field           U;              // optional field name
        // value           uniform (0 0 0);
        // refValue        $value;
        // refGradient     uniform 0.0;
        // valueFraction   uniform 1.0;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            noSlip;
    }
    axis
    {
        type            empty;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    
}

// ************************************************************************* //
